Revit 2026 API

# RebarShapeGetDefaultHookOrientation Method

---

**Note: This API is now obsolete.**

Gets the termination's orientation. The orientation it's the same for both hook and crank.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.GetTerminationsData().TerminationOrientationAtStart or RebarShape.GetTerminationsData().TerminationOrientationAtEnd instead.")]
public RebarHookOrientation GetDefaultHookOrientation(
	int end
)
```
```vb
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.GetTerminationsData().TerminationOrientationAtStart or RebarShape.GetTerminationsData().TerminationOrientationAtEnd instead.")>
Public Function GetDefaultHookOrientation (
	end As Integer
) As RebarHookOrientation
```
```cpp
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.GetTerminationsData().TerminationOrientationAtStart or RebarShape.GetTerminationsData().TerminationOrientationAtEnd instead.")]
RebarHookOrientation GetDefaultHookOrientation(
	int end
)
```
```fsharp
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarShape.GetTerminationsData().TerminationOrientationAtStart or RebarShape.GetTerminationsData().TerminationOrientationAtEnd instead.")>]
member GetDefaultHookOrientation :
        end : int -> RebarHookOrientation
```

#### Parameters

end Int32
     0 for the termination at start, 1 for the termination at end.

#### Return Value

RebarHookOrientation Returns the termination's orientation. The orientation it's the same for both hook and crank.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | end must be 0 or 1. |

#### Reference

RebarShape Class

Autodesk.Revit.DB.Structure Namespace